app/views/sections/index.html.erb

SELECT COUNT(*) FROM `sections`
SELECT `sections`.* FROM `sections`  ORDER BY sections.position ASC
---

<div><%= pluralize(@sections.size, 'section')%> found!</div>

SELECT COUNT(*) FROM `section_edits` WHERE `section_edits`.`section_id` = 1
---
				</td>
				<td class="center"><%= section.section_edits.size %></td>