app/views/pages/index.html.erb

SELECT `pages`.* FROM `pages`  ORDER BY pages.position ASC
---

<div><%= pluralize(@pages.size, 'page')%> found!</div>