app/controllers/admin_users_controller.rb

SELECT  `admin_users`.* FROM `admin_users` WHERE `admin_users`.`id` = 1 LIMIT 1
---
	def edit
		@admin_user = AdminUser.find(params[:id])

SELECT  `admin_users`.* FROM `admin_users` WHERE `admin_users`.`id` = 1 LIMIT 1
---
	def delete
		@admin_user = AdminUser.find(params[:id])