app/controllers/pages_controller.rb

  def show
    #Find the page with :id
    @page = Page.find(params[:id])
---
SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 2 LIMIT 1

  def new
    @page = Page.new({:subject_id => params[:subject_id], :name => "Default"})
    @subjects = Subject.order('position ASC')
    @page_count = Page.count + 1
---
SELECT  `subjects`.* FROM `subjects`  ORDER BY position ASC LIMIT 1
SELECT COUNT(*) FROM `pages`

  def create
    @page = Page.new(page_params)
    if @page.save
      flash[:notice] = "Successfully created new page!"
      redirect_to(:controller => 'pages', :subject_id => @page.subject_id)
    else
      @subjects = Subject.order('position ASC')
      @page_count = Page.count + 1
---
INSERT INTO `pages` (`subject_id`, `name`, `permalink`, `position`, `visible`, `created_at`, `updated_at`) VALUES (3, 'Default', '23d', 1, 1, '2016-06-30 04:45:19', '2016-06-30 04:45:19')
SELECT COUNT(*) FROM `pages`

  def edit
    @page = Page.find(params[:id])
    @subjects = Subject.order('position ASC')
    @page_count = Page.count
---
SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 2 LIMIT 1
SELECT `subjects`.* FROM `subjects`  ORDER BY position ASC
SELECT COUNT(*) FROM `pages`

  def update
    @page = Page.find(params[:id])
    if @page.update_attributes(page_params)
---
SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 2 LIMIT 1
UPDATE `pages` SET `permalink` = '16-yeah', `visible` = 1, `updated_at` = '2016-07-01 23:15:52' WHERE `pages`.`id` = 16

  def delete
    @page = Page.find(params[:id])
---
SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 1 LIMIT 1

  def destroy
    page = Page.find(params[:id]).destroy
---
DELETE FROM `pages` WHERE `pages`.`id` = 1
SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 1 LIMIT 1

  def find_subject
    if params[:subject_id]
      @subject = Subject.find(params[:subject_id])
---
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = NULL  ORDER BY position ASC LIMIT 1