app/controllers/public_controller.rb

SELECT  `pages`.* FROM `pages` WHERE `pages`.`permalink` = 'winkwink' AND `pages`.`visible` = 1  ORDER BY `pages`.`id` ASC LIMIT 1
---
  def show
  	@page = Page.where(:permalink => params[:permalink], :visible => true).first