app/controllers/sections_controller.rb

  def create
    # #instantiate the page associated with the section
    # @page = Page.find(params[:page_id])
    #instantiate a new object using form parameters
    @section = Section.new(section_params)


    #save the object
    if @section.save
---
INSERT INTO `sections` (`page_id`, `name`, `position`, `visible`, `content_type`, `content`, `created_at`, `updated_at`) VALUES (11, 'New Section', 15555, 1, 'text', 'adsfasfadsfa', '2016-06-30 21:13:55', '2016-06-30 21:13:55')

  def edit
    @section = Section.find(params[:id])
---
SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1

  def update
    #Find an existing object using form parameters
    @section = Section.find(params[:id])
    #update the object
    if @section.update_attributes(section_params)
---
SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1
UPDATE `sections` SET `content` = 'helloworld!!kk', `updated_at` = '2016-07-01 23:44:45' WHERE `sections`.`id` = 20

  def destroy
    section = Section.find(params[:id]).destroy
---
DELETE FROM `sections` WHERE `sections`.`id` = 2
SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 2 LIMIT 1

  def find_page
    if params[:page_id]
      @page = Page.find(params[:page_id])
---
SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = NULL LIMIT 1