app/controllers/subjects_controller.rb

  def new
    @subject = Subject.new({:name => "Hello World!"})
    @subject_count = Subject.count + 1
---
SELECT COUNT(*) FROM `subjects`

  def create
    #instantiate a new object with form parameters
    @subject = Subject.new(subject_params)
    #save the object
    if @subject.save
---
INSERT INTO `subjects` (`name`, `position`, `visible`, `created_at`, `updated_at`) VALUES ('Hello World!', 4, 1, '2016-06-22 21:04:45', '2016-06-22 21:04:45')

  def update
    #Find an existing object using form parameters
    @subject = Subject.find(params[:id])
    #update the object
    if @subject.update_attributes(subject_params)
    #If update succeeds, redirect to the index action
      flash[:notice] = "Subject updated successfully!"
      redirect_to(:action => 'show', :id => @subject.id)
    else
    #If update fails, redisplay the form so the user can fix the problems
      @subject_count = Subject.count
---
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
UPDATE `subjects` SET `updated_at` = '2016-07-01 05:14:14.764169', `position` = (`subjects`.`position` - 1) WHERE (1 = 1) AND (`position` > 1) AND (`position` <= 3 AND id != 3)
SELECT COUNT(*) FROM `subjects`

  def destroy
    subject = Subject.find(params[:id]).destroy
---
DELETE FROM `subjects` WHERE `subjects`.`id` = 1
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 5 LIMIT 1 FOR UPDATE