app/views/public/show.html.erb

SELECT `sections`.* FROM `sections` WHERE `sections`.`page_id` = 11 AND `sections`.`visible` = 1  ORDER BY sections.position ASC
---
<h2><%= @page.name %></h2>
<% @page.sections.visible.sorted.each do |section|%>